# Задача 1: Найдите сумму цифр трехзначного числа.
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0)

n = int(input())
summ = 0
while n > 0:
    summ += n % 10
    n = n // 10
print(summ)